MerSETA/Notes/GPCreateVendor_with_VendorClassDefaultingBehavior_and_CreateWithDefaultClassBehavior.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<S:Body xmlns="http://schemas.microsoft.com/dynamics/2006/01"
		xmlns:ns2="http://schemas.microsoft.com/dynamics/gp/2006/01"
		xmlns:ns3="http://schemas.microsoft.com/dynamics/security/2006/01">
		<ns2:CreateVendor>
			<ns2:vendor>
				<ns2:Key>
					<ns2:Id>L000000001</ns2:Id>
				</ns2:Key>
				<ns2:Name>Hendrik Test Vendor 1</ns2:Name>
				<ns2:IsOnHold>false</ns2:IsOnHold>
				<ns2:IsActive>true</ns2:IsActive>
				<ns2:IsOneTime>false</ns2:IsOneTime>
				<ns2:ClassKey>
					<ns2:CompanyKey>
						<Id>2</Id>
					</ns2:CompanyKey>
					<ns2:Id>PLASTICS</ns2:Id>
				</ns2:ClassKey>
			</ns2:vendor>
			<ns2:context xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
				<OrganizationKey xsi:type="CompanyKey">
					<Id>2</Id>
				</OrganizationKey>
				<CultureName>en-US</CultureName>
			</ns2:context>
			<ns2:policy>
				<ns2:Key>
					<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
				</ns2:Key>
				<ns2:Behaviors>
					<ns2:Behavior xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
						<ns2:Key>
							<ns2:PolicyKey>
								<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
							</ns2:PolicyKey>
							<ns2:Id>7b5d30f0-e152-4818-a196-6ba3accd8d32</ns2:Id>
						</ns2:Key>
						<ns2:Internal xsi:nil="true" />
						<ns2:Options>
							<ns2:BehaviorOption>
								<ns2:Key>
									<ns2:BehaviorKey>
										<ns2:PolicyKey>
											<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
										</ns2:PolicyKey>
										<ns2:Id>7b5d30f0-e152-4818-a196-6ba3accd8d32</ns2:Id>
									</ns2:BehaviorKey>
									<ns2:Id>1</ns2:Id>
								</ns2:Key>
							</ns2:BehaviorOption>
						</ns2:Options>
					</ns2:Behavior>
					<ns2:Behavior xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
						<ns2:Key>
							<ns2:PolicyKey>
								<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
							</ns2:PolicyKey>
							<ns2:Id>7b5d30f0-e152-4818-a196-6ba3accd8d33</ns2:Id>
						</ns2:Key>
						<ns2:Internal xsi:nil="true" />
						<ns2:Options>
							<ns2:BehaviorOption>
								<ns2:Key>
									<ns2:BehaviorKey>
										<ns2:PolicyKey>
											<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
										</ns2:PolicyKey>
										<ns2:Id>7b5d30f0-e152-4818-a196-6ba3accd8d33</ns2:Id>
									</ns2:BehaviorKey>
									<ns2:Id>1</ns2:Id>
								</ns2:Key>
								<ns2:Parameters>
									<ns2:Parameter>
										<ns2:Key>
											<ns2:BehaviorOptionKey>
												<ns2:BehaviorKey>
													<ns2:PolicyKey>
														<ns2:Id>66e1feb2-68db-4fd5-a431-70f2fe128cd1</ns2:Id>
													</ns2:PolicyKey>
													<ns2:Id>7b5d30f0-e152-4818-a196-6ba3accd8d33</ns2:Id>
												</ns2:BehaviorKey>
												<ns2:Id>1</ns2:Id>
											</ns2:BehaviorOptionKey>
											<ns2:Id>1</ns2:Id>
										</ns2:Key>
										<ns2:Name>Class Id Parameter</ns2:Name>
										<ns2:Value>PLASTICS</ns2:Value>
									</ns2:Parameter>
								</ns2:Parameters>
							</ns2:BehaviorOption>
						</ns2:Options>
					</ns2:Behavior>
				</ns2:Behaviors>
			</ns2:policy>
		</ns2:CreateVendor>
	</S:Body>
</S:Envelope>
